//除式还原 
#include<iostream>
using namespace std;
int main()
{
  long int i;
  int j,l;
  for(i=10000;i<=99999;i++) //条件1. i为被除数
    //if(i%1000-i%100==400) //条件4. 被除数的第三位一定为4
      for(j=10;j<=99;j++) //条件1. j为余数
       if(i%j==0 && (l=i/j)%100>=70 && l%100<80//条件1.可整除，商的十位数为7
       &&l%10!=0&&l>100&&l<=999)//商的个数不能为0,商l在100到999之间
         if((j*(l%10))<100&&j*(l%10)>10) //条件6.商的个数与除数的积为二位数
           if(j*7%100>=70&&j*7%100<80) //条件5.7乘以除数的积的第二位为7
             if(j*(l/100)%100==77&&j*(l/100)>100)//商的第1位与除数的积的后2位为77
               cout<<i<<"/"<<j<<"="<<l;
  //system("pause");
  return 0;             
}

